app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
  def show
    @user = User.find params[:id]

INSERT INTO `users` (`created_at`, `updated_at`, `last_name`, `email`, `first_name`) VALUES('2009-12-16 00:47:44', '2009-12-16 00:47:44', 'Last', 'maj@something.com', 'MAJ')
---
  def create
    @user = User.new(params[:user])
    @user.save